//SORTREPR JOB ' ',CLASS=A,MSGLEVEL=(1,1),
//          MSGCLASS=X,NOTIFY=&SYSUID
//*
//DELET100 EXEC PGM=IEFBR14
//THEFILE   DD DSN=&SYSUID..QSAM.AA,
// DISP=(MOD,DELETE,DELETE),SPACE=(TRK,0)
//DELET200 EXEC PGM=IEFBR14
//FILE    DD DSN=&SYSUID..QSAM.BB,
// DISP=(MOD,DELETE,DELETE),SPACE=(TRK,0)
//SORT0300  EXEC PGM=SORT
//SYSOUT    DD SYSOUT=*
//SORTIN    DD *
0001JENNIFER       ANDERSON       20220131
0002MICHAEL        WILSON         10200229
0003AMY            THOMPSON       20200229
0004DAVID          BROWN          20210029
0005JESSICA        HERNANDEZ      20220231
0006JAMES          GONZALEZ       20220100
0007SARAH          LOPEZ          99990531
0008CHRISTOPHER    MARTIN         20220630
0009ASHLEY         HILL           20220731
0010MATTHEW        DAVIS          20220831
0011LAURA          WRIGHT         20220131
0012JOHN           THOMAS         20220132
0013MELISSA        HALL           20221130
0014ROBERT         YOUNG          20221231
0015EMILY          MARTINEZ       20220131
0016JASON          MILLER         20200229
0017ANGELA         WHITE          20200229
0018BRIAN          GARCIA         20210229
0019REBECCA        MOORE          20220331
0020DANIEL         ANDERSON       20220430
0021MEGAN          WILSON         20220531
0022KEVIN          THOMPSON       20220630
0023STEPHANIE      BROWN          20220731
0024ALEXANDER      HERNANDEZ      20220831
0025KAREN          GONZALEZ       20220930
0026PATRICK        LOPEZ          20221031
0027RACHEL         MARTIN         20221130
0028ERIC           HILL           20221231
0029LISA           DAVIS          20220131
0030STEVEN         WRIGHT         20200229
0031ASHLEY         THOMAS         20200229
0032JESSICA        YOUNG          20210229
0033JAMES          MARTINEZ       20220331
0034SARAH          MILLER         20220430
0035DAVID          WHITE          20220531
0036AMY            GARCIA         20220630
0037MICHAEL        MOORE          20220731
0038LAURA          ANDERSON       20220831
0039JOHN           WILSON         20220930
0040REBECCA        THOMPSON       20221031
0041CHRISTOPHER    HERNANDEZ      20221130
0042MELISSA        GONZALEZ       20221231
0043ROBERT         LOPEZ          20220131
0044EMILY          MARTIN         20200229
0045JASON          HILL           20200229
0046ANGELA         DAVIS          20210229
0047BRIAN          WRIGHT         20220331
0048DANIEL         THOMAS         20220430
0049MEGAN          YOUNG          20220531
0050KEVIN          MARTINEZ       20220630
//SORTOUT   DD DSN=&SYSUID..QSAM.AA,
// DISP=(NEW,CATLG,DELETE),
// SPACE=(TRK,(5,5),RLSE),
// DCB=(RECFM=FB,LRECL=42)
//SYSIN     DD *
  SORT FIELDS=COPY
//DELET300 EXEC PGM=IEFBR14
//FILE01    DD DSN=&SYSUID..QSAM.BB,
// DISP=(MOD,DELETE,DELETE),SPACE=(TRK,0)
//SORT0400 EXEC PGM=SORT
//SYSOUT    DD SYSOUT=*
//SORTIN    DD DSN=&SYSUID..QSAM.AA,DISP=SHR
//SORTOUT   DD DSN=&SYSUID..QSAM.BB,
// DISP=(NEW,CATLG,DELETE),
// SPACE=(TRK,(5,5),RLSE),
// DCB=(RECFM=FB,LRECL=50)
//SYSIN     DD *
  SORT FIELDS=(1,4,CH,A)
  INCLUDE COND=(1,1,CH,EQ,C'0')
  OUTREC FIELDS=(1,42,DATE1)
